Repository: DavidePonzini/lensql
Catalog: server/locales/*/LC_MESSAGES/messages.po
Languages: it

source: Cannot login. Please check your username and password.
it: Accesso non riuscito. Controlla nome utente e password.

source: Username already exists. Please choose a different username.
it: Il nome utente esiste già. Scegline un altro.

source: Registration failed. Please try again.
it: Registrazione non riuscita. Riprova.

source: Old password is incorrect.
it: La password è incorretta.

source: Failed to reset password. Please try again.
it: Impossibile reimpostare la password. Riprova.

source: Password reset successfully.
it: Password reimpostata con successo.

source: You are not authorized to modify this dataset.
it: Non sei autorizzato a modificare questo dataset.

source: You do not have access to this dataset.
it: Non hai accesso a questo dataset.

source: Dataset does not exist.
it: Il dataset non esiste.

source: This is a special dataset and cannot be left.
it: Questo è un dataset speciale e non può essere abbandonato

source: You cannot leave this dataset, as you are a teacher and it has data associated with it.
it: Non puoi abbandonare questo dataset perché sei un insegnante e contiene dei dati associati.

source: You are not a teacher of this dataset.
it: Non sei un insegnante di questo dataset.

source: You cannot set yourself as a teacher of this dataset.
it: Non puoi assegnarti come insegnante di questo dataset.

source: Dataset ID is required.
it: ID dataset richiesto

source: You are not a participant of this dataset.
it: Non sei un partecipante di questo dataset.

source: You are not authorized to add exercises to this dataset.
it: Non sei autorizzato ad aggiungere esercizi a questo dataset.

source: You are not authorized to edit this exercise.
it: Non sei autorizzato a modificare questo esercizio.

source: You are not authorized to delete this exercise.
it: Non sei autorizzato a cancellare questo esercizio.

source: Cannot delete exercise. There are queries associated with it.
it: Impossibile eliminare l'esercizio. Ci sono query associate.

source: Exercise ID is required.
it: ID esercizio richiesto.

source: You are not authorized to set learning objectives for this exercise.
it: Non sei autorizzato a impostare gli obiettivi didattici per questo esercizio.

source: Congratulations, I couldn't find any errors in your query!
it: Congratulazioni, non ho trovato alcun errore nella tua query!

source: User is not a participant in the specified dataset.
it: L'utente non è un partecipante del dataset specificato.

source: No solution found for this exercise.
it: Nessuna soluzione trovata per questo esercizio.

source: Your query is not supported. Please ensure it is a valid SQL SELECT query.
it: La tua query non è supportata. Assicurati che sia una query SQL SELECT valida.

source: Teacher-provided solution is not supported.
it: La soluzione fornita dall'insegnante non è supportata.

source: Your query has different columns from the solution. Cannot compare results.
it: La tua query ha colonne diverse rispetto alla soluzione. Impossibile confrontare i risultati.

source: Expected:
it: Atteso:

source: Your query:
it: La tua query:

source: Your query has different data types from the solution. Cannot compare results.
it: La tua query ha tipi di dati diversi rispetto alla soluzione. Impossibile confrontare i risultati.

source: Solution is correct.
it: La soluzione è corretta.

source: You don't have enough coins to use this feature. Check the Profile page to learn how to earn more.
it: Non hai abbastanza monete per usare questa funzione. Consulta la pagina del profilo per scoprire come guadagnarne di più.

source: Your query
it: La tua query

source: Solution
it: Soluzione
